In [1]:
import pandas as pd
import random as rnd

In [2]:
python_express = {
                  'PYT001': 'Airbus 320',
                  'PYT002': 'Boeing 737',
                  'PYT003': 'Airbus 321'
}

aircrafts = pd.Series(python_express)
aircrafts

PYT001    Airbus 320
PYT002    Boeing 737
PYT003    Airbus 321
dtype: object

In [3]:
flightsList = []

for i in range(100):
    flightsList.append(rnd.choice(aircrafts.index))

flightsList[:5]

['PYT003', 'PYT001', 'PYT002', 'PYT003', 'PYT001']

In [4]:
flights = pd.Series(flightsList)
flights.head()

0    PYT003
1    PYT001
2    PYT002
3    PYT003
4    PYT001
dtype: object

In [5]:
flights_aircrafts = pd.Series(map(lambda x: python_express[x], flights))
flights_aircrafts.head()

0    Airbus 321
1    Airbus 320
2    Boeing 737
3    Airbus 321
4    Airbus 320
dtype: object

In [6]:
flights_aircrafts = flights.map(aircrafts)
flights_aircrafts.head()

0    Airbus 321
1    Airbus 320
2    Boeing 737
3    Airbus 321
4    Airbus 320
dtype: object